print("โปรแกรมหาพื้นที่3เหลี่ยม")
a = int(input('ใส่ค่าฐาน'))
b = int(input('ใส่ค่าสูง'))
c = 0.5 * a * b
print(f'ค่าพื้นที่ 3เหลี่ยม = {c}')

print("โปรแกรมหาพื้นที่4เหลี่ยมผผ")
a = int(input('ใส่ค่ากว้าง'))
b = int(input('ใส่ค่าสูง'))
c = a * b
print(f'ค่าพื้นที่ 4เหลี่ยมผผ = {c}')

print("โปรแกรมหาพื้นที่4เหลี่ยมจตร")
a = int(input('ใส่ค่า'))
b = a * a
print(f'ค่าพื้นที่ 4เหลี่ยมผผ = {b}')

print("โปรแกรมหาพื้นที่วงกลม")  
radius = float(input('ใส่ค่ารัศมี (เมตร): ')) 
pi = 3.14  
area = pi * radius ** 2  
print(f'ค่าพื้นที่วงกลม: {area:.2f} ตารางเมตร')
